In [1]:
import pandas as pd

#SHRIPAD KHANDARE 735 202201040103

In [4]:
df = pd.read_excel('employee.xlsx')
df

   emp_id first_name    last_name            hire_date
0     120    Matthew       Weisss           18-07-2004
1     121       Adam        Fripp  2005-10-04 00:00:00
2     122      Payam     Kaufling  2003-01-05 00:00:00
3     123     Shanta      Vollman  2005-10-10 00:00:00
4     124      Kevin      Mourgos           16-11-2007
5     125      Julia        Nayer           16-07-2005
6     126      Irene  Mikkilineni           28-09-2006

In [5]:
joining_year = [2004,2005,2003,2005,2007,2005,2006]

In [6]:
df['Join_year']=joining_year

In [7]:
df

   emp_id first_name    last_name            hire_date  Join_year
0     120    Matthew       Weisss           18-07-2004       2004
1     121       Adam        Fripp  2005-10-04 00:00:00       2005
2     122      Payam     Kaufling  2003-01-05 00:00:00       2003
3     123     Shanta      Vollman  2005-10-10 00:00:00       2005
4     124      Kevin      Mourgos           16-11-2007       2007
5     125      Julia        Nayer           16-07-2005       2005
6     126      Irene  Mikkilineni           28-09-2006       2006

In [16]:
df['hire_date'] = pd.to_datetime(df['hire_date'])

C:\Users\MIT\AppData\Local\Temp\ipykernel_15792\2276769665.py:1: UserWarning: Parsing dates in DD/MM/YYYY format when dayfirst=False (the default) was specified. This may lead to inconsistently parsed dates! Specify a format to ensure consistent parsing.
  df['hire_date'] = pd.to_datetime(df['hire_date'])

   emp_id first_name    last_name  hire_date  Join_year
0     120    Matthew       Weisss 2004-07-18       2004
1     121       Adam        Fripp 2005-10-04       2005
2     122      Payam     Kaufling 2003-01-05       2003
3     123     Shanta      Vollman 2005-10-10       2005
4     124      Kevin      Mourgos 2007-11-16       2007
5     125      Julia        Nayer 2005-07-16       2005
6     126      Irene  Mikkilineni 2006-09-28       2006

In [23]:
new1_df = df.loc[df['Join_year'] == 2004]

In [24]:
new1_df

   emp_id first_name last_name  hire_date  Join_year
0     120    Matthew    Weisss 2004-07-18       2004

In [25]:
new2_df = df.loc[df['Join_year'] == 2003]

In [26]:
new2_df

   emp_id first_name last_name  hire_date  Join_year
2     122      Payam  Kaufling 2003-01-05       2003

In [27]:
new3_df = df.loc[df['Join_year'] == 2005]

In [28]:
new3_df

   emp_id first_name last_name  hire_date  Join_year
1     121       Adam     Fripp 2005-10-04       2005
3     123     Shanta   Vollman 2005-10-10       2005
5     125      Julia     Nayer 2005-07-16       2005

In [29]:
new4_df = df.loc[df['Join_year'] == 2006]

In [30]:
new4_df

   emp_id first_name    last_name  hire_date  Join_year
6     126      Irene  Mikkilineni 2006-09-28       2006

In [31]:
new5_df = df.loc[df['Join_year'] == 2007]

In [32]:
new5_df

   emp_id first_name last_name  hire_date  Join_year
4     124      Kevin   Mourgos 2007-11-16       2007